import React from "react";

const comments = [
  {
    name: "محمد الوهيد",
    comment:
      "ماقصرت والله ياعمر الصور حلوه والله الله يجزاك خير الف شكر من لايشكر الناس لايشكر الله الف الف شكر استاذ عمر",
  },
  {
    name: "إبراهيم الهطلاني",
    comment:
    "ما شاء الله تبارك الله تصويرك ابداع ياعمر اسال الله ان يوفقك ويرزق رزق ما حسبت حسابه",
  },
  {
    name: "خالد",
    comment:
      "ما شاء الله تبارك الرحمن 🤩والله ي انت تحفه فنيه وقسم الله لا يضرك",
  },
  {
    name:"أحمد الحربي",
    comment:
"ماعملت البارحة تجاهي جميييل أثقل كاهلي وموقف سيبقى محفول بذاكرتي أحرجتني ب أسلوبك .. تعاملك .. طيبة قلبك أشكرك من أعماااق قلبي شكراً لأنك صنعت ليليتي الله يجزاك عن كل خير ويسعدك ويرزقك ويجعل التوفيق حليفك بكل أمور حياتك" 
 },
  {
    name:"أحمد المطلق",
    comment:
"شكراً شكراً لك من القلب ، ماقصرت والله والفيديو اكثر من رائع والصور اروع الله يجزاك الف خير يارب وفالك التوفيق بالقادم"
 },
  {
    name:"أحمد الحجيلان",
    comment:
"ماشاء الله جمال الصور ✨ أبدعت أبدعت جزاك الله خير ماقصرت ياخي صور وجمال تصوير"
 },
];

function CommentCard({ name, comment }) {
  return (
    <div className="w-[350px] sm:w-[400px] h-[220px] px-4 shrink-0 font-Vazirmatn">
      <div className="w-full h-full rounded-xl border border-[#D8AC4B] bg-[#1F2A24] p-6 flex flex-col justify-center text-center">
        
        <h3 className="font-vazirmatn text-[#D8AC4B] text-xl font-semibold mb-4">
          {name}
        </h3>

        <p className="font-vazirmatn text-[#E7F2E2] text-base leading-7 line-clamp-4">
          {comment}
        </p>

      </div>
    </div>
  );
}

export default function CommentSlider() {
  return (
    <section className="py-12 overflow-hidden bg-[#202C28]">
      <div className="relative w-full overflow-hidden">
        
        <div className="flex animate-scroll gap-6">
          {[...comments, ...comments].map((item, index) => (
            <CommentCard key={index} {...item} />
          ))}
        </div>

      </div>
    </section>
  );
}
